<?php
/**
 * Мастеру дали восемь цепей по 6 звеньев в каждой. Его попросили соединить их в одну непрерывную цепь. Он выполнил просьбу, при этом он разъединил и обратно соединил всего 6 звеньев. Как ему это удалось?
 */

// Берем одну цепь и рассоединяем в ней все 6 звеньев.
// Остается 7 цепей, выкладываем их в одну линию друг за другом
// Между ними 6 пробелов. Как раз эти пробелы заполняем каждым рассоединенным звеном первой цепи
// Соединем 6 звеньев, таикм образом получается непрерывная цепь из 48 звеньев.